## Instructions

1) Please watch recitation videos by TAs and my lecture video on Jupyternotebook before doing this lab.

2) After finishing the lab, save files as html and ipynb. 

3) To submit HW solutions, go to our course in Canvas --> Assignments --> HW 1 --> Submit Assignment --> Click "Chose file" --> choose HTML file you saved --> Click another file--> choose ipynb file--submit.

4) Once you submit, download,  and check to make sure that you have submitted the correct files. 

5) When workingfor the solutions to this lab, please do not display unnecessary data unless it is asked.  

6) Please do not share codes or the solutions in the piazza. We can still ask and clarify questions.

7) Private messages to your Instructors and TAs should be used to ask questions about codes and other details.

8) Each problem is worth 10 points.

#### Each problem is worth 10 points.

In [3]:
#import packages
import pandas as pd
import numpy as np

### Problem 1. 
Upload the .csv file titanic.csv that came with this HW in the notebook, and name it as titanic. Make sure to import panda as pd and numpy as np.  Those are the necessary packages. Read the details about the titanic data here https://data.world/nrippner/titanic-disaster-dataset. Show the head of the data and find out how many rows and columns are in the data.

In [4]:
df=pd.read_csv("titanic.csv")
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [5]:
print("Number of rows and columns are:",df.shape)

Number of rows and columns are: (1310, 14)

### Problem 2. 
 Make a list of variables in the titanic data set. Then classify all the variables as one of discrete, continuous, nominal, and ordinal. Explain how you determined the types of variables.

In [6]:
df.dtypes

pclass       float64
survived     float64
name          object
sex           object
age          float64
sibsp        float64
parch        float64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

Name: Discrete
    As names can be of different combinations,but definite, hence discrete

Sex: Nominal
    Sex can be Male or Female. Hence Nominal

Age: Continuous
    Age can vary person to person, and also can change from when it gets determined. Hence Continuous.

Ticket: Discrete
    As money is definite, though random, can be completely accounted for. Hence Discrete

Cabin: Ordinal
    As there is clear order within the cabins of the ship, hence ordinal.

Embarked: Nominal
    As embarked has has three categories, but there is no intrinsic ordering to the categories, hence Nominal.

Boat: Ordinal
    As there is a specific order and series of lifeboats, hence ordinal
    
home.dest: Discrete
    As the names of destinations are all different but finite, hence discrete

### Problem 3. 
 Learn more about isnull() or isna() function  here https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.isnull.html and use it to find how many missing values does each variable has. Find out which three variables have the most missing values, remove them from the data frame, and name the new data frame as titanic1.

In [7]:
pd.isna(df).sum()

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

I have created a new DataFrame which has the variables excluding the top 3

In [20]:
titaniccols = ['pclass','survived','name','sex','age','sibsp','parch','ticket','fare','embarked','home.dest']
titanic1 = df [titaniccols]
titanic1.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'embarked', 'home.dest'],
      dtype='object')

In [21]:
titanic1.shape

(1310, 11)

### Problem 4. 
Filter the titanic1 data with and operator. https://kanoki.org/2020/01/21/pandas-dataframe-filter-with-multiple-conditions/

a) How many passengers who paid less than the average fare survived? 

b) Did a passenger who embarked journey from Queenstown and was of 40 years of age survive?

In [22]:
titanic1[(df['fare']<=400) & (df['age']==40) & (df['survived']==1.0) & df['embarked'].str.startswith('Q')][['fare','survived','age','embarked']]

Empty DataFrame
Columns: [fare, survived, age, embarked]
Index: []

Basically, no such survivor exists of 40 years of age who boarded from queenstown. Hence it does not return any value

### Problem 5. 
Continuing with the titanic1 data set, answer the following questions.

a) Use groupby function to find out how many passengers were in each class. https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html

b) Create a new column with a column name “luck”  in the titanic1 data set with the following rules. Let’s call a passenger “unlucky” if the passenger was in the first-class, paid more than the average fare, and did not survive.  On the contrary, a passenger is “lucky” if the passenger was not in the first class, paid less or equal to the average fare, and survived. Let’s call everybody else, “averageluck.”  Show the head of the data with a visible luck column.

In [32]:
titanic1

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,S,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,C,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,C,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,C,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,S,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [36]:
gk = titanic1.groupby('pclass')

First Series of Group

In [53]:
gk.first()

,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,home.dest
pclass,,,,,,,,,,
1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0,0.0,0.0,24160,211.3375,S,"St Louis, MO"
2.0,0.0,"Abelson, Mr. Samuel",male,30.0,1.0,0.0,P/PP 3381,24.0000,C,"Russia New York, NY"
3.0,0.0,"Abbing, Mr. Anthony",male,42.0,0.0,0.0,C.A. 5547,7.5500,S,"East Providence, RI"

In [44]:
titanic1.count()

pclass       1309
survived     1309
name         1309
sex          1309
age          1046
sibsp        1309
parch        1309
ticket       1309
fare         1308
embarked     1307
home.dest     745
dtype: int64

In [55]:
gk.get_group('1.0')

KeyError: '1.0'

In [ ]:
gk.get_group('2.0')

In [56]:
gk.get_group('3.0')

KeyError: '3.0'